{
    "1": {
        "desc": "Ahoj, podle manuálu napiš platné číslo do countingu obsahující číslici 1 na libovolné pozici.",
        "answer": null
    },
    "2": {
        "desc": "Navštiv památník klíče key2. Že neznáš key2? No přece key2:",
        "answer": "L2ZpbGUvREtCWEFUQlIj"
    },
    "3": {
        "desc": "Taky máš rád self role? Hlavně mám rád tu třetí, víš jakou myslím?",
        "answer": "NSFW"
    },
    "4": {
        "desc": "V poslední době jsem hrál FildaSexyGod Adventure. Viděl jsi druhou cutscénu? Však víš, jak se jmenuje?",
        "answer": "CUM"
    },
    "5": {
        "desc": "Slyšel jsem, že prý dnes dává dárky Mikuláš. A já pořád nevím, čemu se rovná n. Prý že n=87814385+12345678. No určitě bych si to měl zapamatovat do budoucna.",
        "answer": "100160063"
    },
    "6": {
        "desc": "Jenom pro tebe jsem zajistil upload epic minihry - .minigame maze.",
        "answer": null
    },
    "7": {
        "desc": "Taky tak rád posloucháš Končáka?",
        "answer": null
    },
    "8": {
        "desc": "Viděl jsi ten epic FildaGames store? Doufám, že máš propojený účet. Jak to zjistíš? No přece přes .store.",
        "answer": null
    },
    "9": {
        "desc": "Taky máš tak moc rád tu super hru?... No tu, jak se sakra jmenuje... No tu, co je jako 1. secret v I Wanna Kill Filda4515...",
        "answer": "Vampire Survivors"
    },
    "10": {
        "desc": "Určitě znáš odpověď na tuhle klasiku: Na poličce knihovny vedle sebe stojí deset knih. Každá z nich má sto stran. Knihomol knižní se do nich pustí přímo od první strany první knihy a prožere listy až do té poslední strany poslední knihy. Když prožere i tu, snaží se spočítat kolik stran prožral celkem?",
        "answer": "802"
    },
    "11": {
        "desc": "Čau, neviděl jsi tu někde mého psa? Zaběhl se mi někde na serveru a nemůžu ho najít. Jeho jméno je:",
        "answer": "Ben"
    },
    "12": {
        "desc": "Let's go, dneska vyšel Klavier Adventure! Víš, kolik stojí €?",
        "answer": "0.49"
    },
    "13": {
        "desc": "(unlock tp blue) #TODO",
        "answer": null
    },
    "14": {
        "desc": "Hej, chtěl jsem si koupit hru Agent Filda4515. Nevíš kolik € stojí bez slev?",
        "answer": "1.99"
    },
    "15": {
        "desc": "Zase mám problém, čemu se rovná e? Vím že e=n-24445120. No určitě bych si to měl zapamatovat do budoucna stejně, jako číslo n, které by se mi teď hodilo.",
        "answer": "75714943"
    },
    "16": {
        "desc": "Taky se ti líbí Agent Filda4515 OST? Můj nejoblíbenější je 56.",
        "answer": "Mexico Mexico"
    },
    "17": {
        "desc": "Taky se ti líbí ten epic remix v 1. světě ze hry IWKF4515? Víš, kdo ho udělal?",
        "answer": "Hspsr"
    },
    "18": {
        "desc": "(unlock tp yellow) #TODO",
        "answer": null
    },
    "19": {
        "desc": "Zdravím tě dobrodruhu, znáš RSA šifru? Dokázal by jsi mi zašifrovat slovo \"pes\" pro binární reprezentaci 9 bitů?",
        "answer": "28333022"
    },
    "20": {
        "desc": "Odemkl jsem ti spell meteor. Red, Blue, Yellow... Síla přátelství ti pomůže.",
        "answer": null
    },
    "21": {
        "desc": "(isnice) #TODO",
        "answer": null
    },
    "22": {
        "desc": "Ahoj, to jsem zase já... Mám zase problém, tentokrát nevím, čemu se rovná d. Slyšel jsem, že (d-871)/1000=9261*9.",
        "answer": "83349871"
    },
    "23": {
        "desc": "(isnice) #TODO",
        "answer": null
    },
    "24": {
        "desc": "Opět tě zdravím dobrodruhu, teď už mi určitě dokážeš odšifrovat tuhle zprávu pomocí RSA šifry pro binární reprezentaci 9 bitů: \"64366890\".",
        "answer": "Ne!"
    }
}